In [1]:
import pandas as pd

In [9]:
data = pd.read_csv("gapminder - gapminder.csv")

In [10]:
data.head()

   Unnamed: 0      country  year  population continent  life_exp       gdp_cap
0          11  Afghanistan  2007    31889923      Asia    43.828    974.580338
1          23      Albania  2007     3600523    Europe    76.423   5937.029526
2          35      Algeria  2007    33333216    Africa    72.301   6223.367465
3          47       Angola  2007    12420476    Africa    42.731   4797.231267
4          59    Argentina  2007    40301927  Americas    75.320  12779.379640

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  142 non-null    int64
 1   country     142 non-null    object
 2   year        142 non-null    int64
 3   population  142 non-null    int64
 4   continent   142 non-null    object
 5   life_exp    142 non-null    float64
 6   gdp_cap     142 non-null    float64
dtypes: float64(2), int64(3), object(2)
memory usage: 7.9+ KB

In [16]:
data.drop("Unnamed: 0" , inplace= True , axis = 1 )

In [17]:
data.head()

       country  year  population continent  life_exp       gdp_cap
0  Afghanistan  2007    31889923      Asia    43.828    974.580338
1      Albania  2007     3600523    Europe    76.423   5937.029526
2      Algeria  2007    33333216    Africa    72.301   6223.367465
3       Angola  2007    12420476    Africa    42.731   4797.231267
4    Argentina  2007    40301927  Americas    75.320  12779.379640

In [18]:
data.country.value_counts()

Afghanistan          1
Pakistan             1
New Zealand          1
Nicaragua            1
Niger                1
                    ..
Eritrea              1
Equatorial Guinea    1
El Salvador          1
Egypt                1
Zimbabwe             1
Name: country, Length: 142, dtype: int64

In [19]:
data.shape

(142, 6)

In [20]:
data.country.nunique()

142

In [21]:
data.country.unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [22]:
data.year.value_counts()

2007    142
Name: year, dtype: int64

In [23]:
data.sample()

   country  year  population continent  life_exp     gdp_cap
46  Gambia  2007     1688359    Africa    59.448  752.749726

In [24]:
data.population.mean()

44021219.57042254

In [26]:
data.life_exp.mean()

67.00742253521126

In [27]:
data.life_exp.median()

71.93549999999999

In [28]:
data.describe()

         year    population    life_exp       gdp_cap
count   142.0  1.420000e+02  142.000000    142.000000
mean   2007.0  4.402122e+07   67.007423  11680.071820
std       0.0  1.476214e+08   12.073021  12859.937337
min    2007.0  1.995790e+05   39.613000    277.551859
25%    2007.0  4.508034e+06   57.160250   1624.842248
50%    2007.0  1.051753e+07   71.935500   6124.371108
75%    2007.0  3.121004e+07   76.413250  18008.835640
max    2007.0  1.318683e+09   82.603000  49357.190170

In [34]:
data.count()

country       142
year          142
population    142
continent     142
life_exp      142
gdp_cap       142
dtype: int64

In [37]:
data.rename(columns= {"year" : "Year" } , inplace= True)

In [38]:
data.tail()

                country  Year  population continent  life_exp      gdp_cap
137             Vietnam  2007    85262356      Asia    74.249  2441.576404
138  West Bank and Gaza  2007     4018332      Asia    73.422  3025.349798
139         Yemen, Rep.  2007    22211743      Asia    62.698  2280.769906
140              Zambia  2007    11746035    Africa    42.384  1271.211593
141            Zimbabwe  2007    12311143    Africa    43.487   469.709298